app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    # @article.user = User.first
    @article.user = User.find(session[:user_id]) unless session[:user_id].nil?
    if @article.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Getreouisdg"], ["description", "gdgdgrfs fghfh gdggd gdf"], ["created_at", "2022-09-10 16:38:42.216368"], ["updated_at", "2022-09-10 16:38:42.216368"], ["user_id", 2]]

  def show
    @article = Article.find_by(id: params[:id].to_i)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]