app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.order(created_at: 'asc').paginate(page: params[:page], per_page: 3)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)